jonacappelle/nRF52-BLE-IMU/IMU/imu.c
		// Stop IMU
		ble_tms_config_t temp;
		memset(&temp, 0, sizeof(temp)); // Reset values to zero -> Turn off all sensors
		err_code = imu_enable_sensors(&temp);
		APP_ERROR_CHECK(err_code);

		// Reset accuracy when fully calibrated
		// imu_data.gyro_accuracy = 0;
		// imu_data.accel_accuracy = 0;
		// imu_data.mag_accuracy = 0;

	}else if (imu_data.gyro_accuracy == 3 && imu_data.accel_accuracy == 3)
	{
		NRF_LOG_INFO("Start timer 200ms");
		NRF_LOG_INFO("ACCEL CALIBRATED");
		stop_calibration_timer();
		start_calibration_timer(200);
		send_calibration(false, true, true, false);
	}else if (imu_data.gyro_accuracy == 3)
	{
		NRF_LOG_INFO("Start timer 500ms");
		NRF_LOG_INFO("GYRO CALIBRATED");
		stop_calibration_timer();
		start_calibration_timer(500);
		send_calibration(false, true, false, false);
	}
}


/*
 * Callback called upon sensor event reception
 * This function is called in the same function than inv_device_poll()
 */
static void sensor_event_cb(const inv_sensor_event_t * event, void * arg)
{

// NRF_LOG_INFO("IMU CALLBACK");

// Data processed in 
/* static inv_bool_t build_sensor_event_data(inv_device_icm20948_t * self, 
		uint8_t sensortype, const void * data, const void *arg, 
		inv_sensor_event_t * event) */

        /* arg will contained the value provided at init time */
        (void)arg;
        
        (void)event;
        /* ... do something with event */
	
				// NRF_LOG_INFO("Sensor event!");
				//NRF_LOG_FLUSH();	
	
	if(event->status == INV_SENSOR_STATUS_DATA_UPDATED) {
		
		// Temp
// imu_send_data();

// NRF_LOG_INFO("accuracy gyr: %d - acc: %d - mag: %d: quat: %d", 
// 		(int)(event->data.gyr.accuracy_flag), 
// 		(int)(event->data.acc.accuracy_flag), 
// 		(int)(event->data.mag.accuracy_flag), 
// 		(int)(event->data.quaternion.accuracy_flag));
		
		ret_code_t err_code;
		size_t len_in;
		
		uint8_t config_data[1];
		
		counterr++;


	switch(INV_SENSOR_ID_TO_TYPE(event->sensor)) {

		case INV_SENSOR_TYPE_RAW_ACCELEROMETER:
		case INV_SENSOR_TYPE_RAW_GYROSCOPE:
		{
//			NRF_LOG_INFO("data event: %d %d %d %d", //inv_sensor_str(event->sensor),
//					(int)event->timestamp,
//					(int)event->data.raw3d.vect[0],
//					(int)event->data.raw3d.vect[1],
//					(int)event->data.raw3d.vect[2]);
				NRF_LOG_INFO("Data");
//					NRF_LOG_INFO("%d	%d	%d", event->data.raw3d.vect[0], event->data.raw3d.vect[1], event->data.raw3d.vect[2]);
			break;
		}
		case INV_SENSOR_TYPE_ACCELEROMETER:
		case INV_SENSOR_TYPE_LINEAR_ACCELERATION:
		case INV_SENSOR_TYPE_GRAVITY:
		{
			// NRF_LOG_INFO("data event %s (mg): %d %d %d %d", inv_sensor_str(event->sensor),
			// 		(int)(event->data.acc.vect[0]*1000),
			// 		(int)(event->data.acc.vect[1]*1000),
			// 		(int)(event->data.acc.vect[2]*1000),
			// 		(int)(event->data.acc.accuracy_flag));
					
				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_ACCEL;
				len_in = sizeof(config_data);

				uint32_t buffer_acc_len = sizeof(config_data) + sizeof(event->data.acc.vect);
				uint8_t buffer_acc[buffer_acc_len];

				// Copy data into buffer
				memcpy(buffer_acc, config_data, sizeof(config_data));
				memcpy(&buffer_acc[1], (event->data.acc.vect), sizeof(event->data.acc.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&buff.imu_fifo, buffer_acc, &buffer_acc_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif

				// NRF_LOG_INFO("accel accuracy: %d", (int)(event->data.acc.accuracy_flag));

				// Save latest data in buffer
				imu_data.accel.x =      (int16_t)((event->data.acc.vect[0]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
				imu_data.accel.y =      (int16_t)((event->data.acc.vect[1]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
				imu_data.accel.z =      (int16_t)((event->data.acc.vect[2]) * (1 << RAW_Q_FORMAT_ACC_COMMA_BITS));

				

				// Save accuracy flag if it changes
				if(event->data.acc.accuracy_flag != imu_data.accel_accuracy)
				{
					
					if(config_is_calibration_active())
					{
						NRF_LOG_INFO("Cal status: accel: %d", event->data.acc.accuracy_flag);
						imu_data.accel_accuracy = event->data.acc.accuracy_flag;
						calibration_callback();
					}
				}
				

			break;
		}
		case INV_SENSOR_TYPE_GYROSCOPE:
		{
			// NRF_LOG_INFO("data event %s (mdps): %d %d %d %d", inv_sensor_str(event->sensor),
			// 		(int)(event->data.gyr.vect[0]*1000),
			// 		(int)(event->data.gyr.vect[1]*1000),
			// 		(int)(event->data.gyr.vect[2]*1000),
					// (int)(event->data.gyr.accuracy_flag));
					
				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_GYRO;
				len_in = sizeof(config_data);

				uint32_t buffer_gyro_len = sizeof(config_data) + sizeof(event->data.gyr.vect);
				uint8_t buffer_gyro[buffer_gyro_len];

				// Copy data into buffer
				memcpy(buffer_gyro, config_data, sizeof(config_data));
				memcpy(&buffer_gyro[1], (event->data.gyr.vect), sizeof(event->data.gyr.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&buff.imu_fifo, buffer_gyro, &buffer_gyro_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif

				// NRF_LOG_INFO("gyro accuracy: %d", (int)(event->data.gyr.accuracy_flag));

				// Save latest data in buffer
				imu_data.gyro.x =       (int16_t)((event->data.gyr.vect[0]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
				imu_data.gyro.y =       (int16_t)((event->data.gyr.vect[1]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
				imu_data.gyro.z =       (int16_t)((event->data.gyr.vect[2]) * (1 << RAW_Q_FORMAT_GYR_COMMA_BITS));

				

				// Save accuracy flag
				if(event->data.gyr.accuracy_flag != imu_data.gyro_accuracy)
				{
					
					if(config_is_calibration_active())
					{
						NRF_LOG_INFO("Cal status: gyro: %d", event->data.gyr.accuracy_flag);
						imu_data.gyro_accuracy = event->data.gyr.accuracy_flag;
						calibration_callback();
					}
				}
				

			break;
		}
		case INV_SENSOR_TYPE_MAGNETOMETER:
		{
			// NRF_LOG_INFO("data event %s (nT): %d %d %d %d", inv_sensor_str(event->sensor),
			// 		(int)(event->data.mag.vect[0]*1000),
			// 		(int)(event->data.mag.vect[1]*1000),
			// 		(int)(event->data.mag.vect[2]*1000),
			// 		(int)(event->data.mag.accuracy_flag));
					
				#ifdef USE_NUS
				// Put data in the ringbuffer
				config_data[0] = ENABLE_MAG;
				len_in = sizeof(config_data);

				uint32_t buffer_mag_len = sizeof(config_data) + sizeof(event->data.mag.vect);
				uint8_t buffer_mag[buffer_mag_len];

