jonacappelle/nRF52-BLE-IMU/IMU/imu.c
			// Reset status before starting calibration
			imu_data.gyro_accuracy = 0;
			imu_data.accel_accuracy = 0;
			imu_data.mag_accuracy = 0;

			calibration_callback();

			NRF_LOG_INFO("Start GYRO for calibration");
			rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
			check_rc(rc);
			rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_GYROSCOPE, IMU_DEFAULT_SAMPL_FREQ);
			check_rc(rc);
			rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
			check_rc(rc);

			NRF_LOG_INFO("Start ACCEL for calibration");
			rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
			check_rc(rc);
			rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_ACCELEROMETER, IMU_DEFAULT_SAMPL_FREQ);
			check_rc(rc);
			rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
			check_rc(rc);

			NRF_LOG_INFO("Start MAG for calibration");
			rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
			check_rc(rc);
			rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_MAGNETOMETER, IMU_DEFAULT_SAMPL_FREQ);
			check_rc(rc);
			rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
			check_rc(rc);
		}
		if(!p_evt->start_calibration)
		{
			NRF_LOG_INFO("Stop calibration");
			stop_calibration_timer();
		}
		
		return NRF_SUCCESS;
}

static void imu_buff_init()
{
	ret_code_t err_code;

	// Initialize IMU FIFO structure
	err_code = app_fifo_init(&buff.imu_fifo, buff.imu_fifo_buff, (uint16_t)sizeof(buff.imu_fifo_buff));
	APP_ERROR_CHECK(err_code);

	// Initialize QUAT FIFO structure
	err_code = app_fifo_init(&buff.quat_fifo, buff.quat_fifo_buff, (uint16_t)sizeof(buff.quat_fifo_buff));
	APP_ERROR_CHECK(err_code);

	// Initialize RAW FIFO structure
	err_code = app_fifo_init(&buff.raw_fifo, buff.raw_fifo_buff, (uint16_t)sizeof(buff.raw_fifo_buff));
	APP_ERROR_CHECK(err_code);
}

void imu_clear_buff()
{
	ret_code_t err_code;

	// Clear all data in buffers
	err_code = app_fifo_flush(&buff.imu_fifo);
	APP_ERROR_CHECK(err_code);

	err_code = app_fifo_flush(&buff.quat_fifo);
	APP_ERROR_CHECK(err_code);

	err_code = app_fifo_flush(&buff.raw_fifo);
	APP_ERROR_CHECK(err_code);
}

void imu_power_en(bool enable)
{
	ret_code_t err_code;

#if BYPASS_IMU_VDD == 1
	nrf_gpio_cfg_input(IMU_POWER_PIN, NRF_GPIO_PIN_NOPULL);
#endif

#if BYPASS_IMU_VDD == 0

	if(enable)
	{
		// Set pin modes - set high drive strength
		nrf_gpio_cfg(IMU_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_DISCONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_H0H1, NRF_GPIO_PIN_NOSENSE);
		// Set pin high to enable IMU
		nrf_gpio_pin_set(IMU_POWER_PIN);
		err_code = NRF_SUCCESS;
	}
	else if(!enable)
	{
		// Set pin low to disable IMU
		nrf_gpio_pin_clear(IMU_POWER_PIN);
		// Set to default pin configuration: input with no pull resistors
		nrf_gpio_cfg_default(IMU_POWER_PIN);
		err_code = NRF_SUCCESS;
	}
	else
	{
		err_code = NRF_ERROR_INVALID_PARAM;
	}
	APP_ERROR_CHECK(err_code);

	// Some delay - may not be necessary
	nrf_delay_ms(100);
	
#endif
}


void imu_init(void)
{
#if IMU_ENABLED == 1

		NRF_LOG_INFO("IMU Init");

		// Enable storing calibration values to flash
		usr_flash_init();

		// Power on the IMU
		imu_power_en(true);

		// Initialize necessary buffers for data transmission
		imu_buff_init();

		/*
		 * Setup message facility to see internal traces from IDD
		 */
		INV_MSG_SETUP(MSG_LEVEL, msg_printer);

		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		INV_MSG(INV_MSG_LEVEL_INFO, "#          20948 example          #");
		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		NRF_LOG_FLUSH();

		/* To keep track of errors */
		int rc = 0;
		
		uint8_t whoami;
		
		/* Open serial interface (SPI or I2C) before playing with the device */
		// Not needed anymore - this is implemented in the inv_host_serif_open(&my_serif_instance)
//		twi_init();
		// rc = inv_host_serif_open(&my_serif_instance);
		// check_rc(rc);
		
		NRF_LOG_INFO("i2c init");
		NRF_LOG_FLUSH();
		
		/*
		 * Create ICM20948 Device 
		 * Pass to the driver:
		 * - reference to serial interface object,
		 * - reference to listener that will catch sensor events,
		 */
		inv_device_icm20948_init(&device_icm20948, &my_serif_instance, &sensor_listener, dmp3_image, sizeof(dmp3_image));
		
		/*
		 * Simply get generic device handle from Icm20948 Device
		 */
		device = inv_device_icm20948_get_base(&device_icm20948);
		NRF_LOG_FLUSH();
		
		/* Just get the whoami */
		rc += inv_device_whoami(device, &whoami);
		check_rc(rc);
		NRF_LOG_INFO("Data: 0x%x", whoami);
		NRF_LOG_FLUSH();

		/* Configure and initialize the Icm20948 device */
		NRF_LOG_INFO("Setting up ICM20948");
		NRF_LOG_FLUSH();
		rc += inv_device_setup(device);
		check_rc(rc);
		
		rc += inv_device_load(device, (int) NULL, dmp3_image, sizeof(dmp3_image), true /* verify */, (int) NULL);
		check_rc(rc);

		NRF_LOG_INFO("DMP Image loaded");
		NRF_LOG_FLUSH();

		// Apply stored IMU offsets from flash
		apply_stored_offsets();

		NRF_LOG_INFO("Stored offsets applied");

		NRF_LOG_INFO("IMU Initialized successfully");
		NRF_LOG_FLUSH();


#endif
}
void imu_re_init(void)
{
#if IMU_ENABLED == 1

		NRF_LOG_INFO("IMU re-init");

		// Re-enable IMU timer
		imu_timers_init();

		// Power on the IMU
		// imu_power_en(true);

		// Initialize necessary buffers for data transmission
		// imu_buff_init();

		/*
		 * Setup message facility to see internal traces from IDD
		 */
		INV_MSG_SETUP(MSG_LEVEL, msg_printer);

		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		INV_MSG(INV_MSG_LEVEL_INFO, "#          20948 example          #");
		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		NRF_LOG_FLUSH();

		/* To keep track of errors */
		int rc = 0;
		
		uint8_t whoami;
		
		/* Open serial interface (SPI or I2C) before playing with the device */
		// Not needed anymore - this is implemented in the inv_host_serif_open(&my_serif_instance)
//		twi_init();
		// rc = inv_host_serif_open(&my_serif_instance);
		// check_rc(rc);
		
		NRF_LOG_INFO("i2c init");
		NRF_LOG_FLUSH();
		
