jonacappelle/nRF52-BLE-IMU/IMU/imu.c
		/*
		 * Create ICM20948 Device 
		 * Pass to the driver:
		 * - reference to serial interface object,
		 * - reference to listener that will catch sensor events,
		 */
		// inv_device_icm20948_init(&device_icm20948, &my_serif_instance, &sensor_listener, dmp3_image, sizeof(dmp3_image));
		
		/*
		 * Simply get generic device handle from Icm20948 Device
		 */
		// device = inv_device_icm20948_get_base(&device_icm20948);
		// NRF_LOG_FLUSH();
		
		/* Just get the whoami */
		rc += inv_device_whoami(device, &whoami);
		check_rc(rc);
		NRF_LOG_INFO("Data: 0x%x", whoami);
		NRF_LOG_FLUSH();

		/* Configure and initialize the Icm20948 device */
		NRF_LOG_INFO("Setting up ICM20948");
		NRF_LOG_FLUSH();
		rc += inv_device_setup(device);
		check_rc(rc);
		
		rc += inv_device_load(device, (int) NULL, dmp3_image, sizeof(dmp3_image), true /* verify */, (int) NULL);
		check_rc(rc);

		NRF_LOG_INFO("DMP Image loaded");
		NRF_LOG_FLUSH();


		// Apply stored IMU offsets from flash
		apply_stored_offsets();


		// Init IMU + reset device
		// Keep track of WoM state
		imu_set_in_wom(false);
#endif
}






uint8_t number_of_quat_packets = 0;
uint8_t number_of_raw_packets = 0;




void imu_send_data(ble_tms_config_t* p_evt, uint32_t sample_time_ms)
{
	ret_code_t err_code;

	if(p_evt->quat6_enabled || p_evt->quat9_enabled)
	{
		ble_tms_single_quat_t single_quat;
		uint32_t single_quat_len = sizeof(single_quat);

		// Put data in send buffer + increment packet counter
		number_of_quat_packets++;

		// Get latest available data
		single_quat.w = imu_data.quat.w;
		single_quat.x = imu_data.quat.x;
		single_quat.y = imu_data.quat.y;
		single_quat.z = imu_data.quat.z;

		// Add timestamp
		single_quat.timestamp_ms = sample_time_ms;

		// Put data in send buffer
		err_code = app_fifo_write(&buff.quat_fifo, (uint8_t *) &single_quat, &single_quat_len);
		if (err_code == NRF_ERROR_NO_MEM)
		{
			NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
		}

		// If 10 packets are queued, send them out
		if( number_of_quat_packets >= BLE_PACKET_BUFFER_COUNT)
		{		
			ble_tms_quat_t data;
			uint32_t data_len = sizeof(data);

			err_code = app_fifo_read(&buff.quat_fifo, (uint8_t *) &data, &data_len);
			if (err_code == NRF_ERROR_NO_MEM)
			{
				NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
			}

			// Send data over BLE
			ble_send_quat(&data);

			number_of_quat_packets = 0;
			// NRF_LOG_INFO("quat set");
		}

	}
	if(p_evt->gyro_enabled || p_evt->accel_enabled || p_evt->mag_enabled)
	{
		ble_tms_single_raw_t single_raw;
		uint32_t single_raw_len = sizeof(single_raw);

		// Put data in send buffer + increment packet counter
		number_of_raw_packets++;

		// Get latest available data
		// Get last gyro data from buffer
		single_raw.gyro.x = imu_data.gyro.x;
		single_raw.gyro.y = imu_data.gyro.y;
		single_raw.gyro.z = imu_data.gyro.z;

		// Get last accel data from buffer
		single_raw.accel.x = imu_data.accel.x;
		single_raw.accel.y = imu_data.accel.y;
		single_raw.accel.z = imu_data.accel.z;

		// Get last mag data from buffer
		single_raw.compass.x = imu_data.mag.x;
		single_raw.compass.y = imu_data.mag.y;
		single_raw.compass.z = imu_data.mag.z;

		// Add timestamp
		single_raw.timestamp_ms = sample_time_ms;

		NRF_LOG_INFO("timestamp raw: %d", single_raw.timestamp_ms);

		// Put data in send buffer
		err_code = app_fifo_write(&buff.raw_fifo, (uint8_t *) &single_raw, &single_raw_len);
		if (err_code == NRF_ERROR_NO_MEM)
		{
			NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
		}

		// If 10 packets are queued, send them out
		if( number_of_raw_packets >= BLE_PACKET_BUFFER_COUNT)
		{		
			ble_tms_raw_t data;
			uint32_t data_len = sizeof(data);

			err_code = app_fifo_read(&buff.raw_fifo, (uint8_t *) &data, &data_len);
			if (err_code == NRF_ERROR_NO_MEM)
			{
				NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
			}

			// Send data over BLE
			ble_send_raw(&data);

			number_of_raw_packets = 0;
			// NRF_LOG_INFO("quat set");
		}
	}
	if(p_evt->euler_enabled)
	{
		ble_tms_euler_t data;

		data.yaw = imu_data.euler.yaw;
		data.pitch = imu_data.euler.pitch;
		data.roll = imu_data.euler.roll;

		// Add timestamp
		data.timestamp_ms = sample_time_ms;

		// Send data over BLE
		ble_send_euler(&data);

	}
	// Not implemented yet
	if(p_evt->adc_enabled)
	{
		ble_tms_adc_t data;

		data.raw[0] = 1;

		// Add timestamp
		data.timestamp_ms = sample_time_ms;

		ble_send_adc(&data);
	}
}


void imu_set_config()
{
	int rc = 0;

	// 0 -> low power mode
	// 1 -> low noise mode
	inv_sensor_config_powermode_t power_mode;
	power_mode.lowpower_or_highperformance = 0;
    
	// rc = inv_device_set_sensor_config(device, 0, INV_SENSOR_CONFIG_POWER_MODE, &power_mode, 1);
	// check_rc(rc);

	NRF_LOG_INFO("Ping SMD");
	rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_SMD);
	check_rc(rc);

	NRF_LOG_INFO("Set SMD period");
	rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_SMD, 0);
	check_rc(rc);

	NRF_LOG_INFO("Start SMD");
	rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_SMD);
	check_rc(rc);

	// dmp_icm20948_set_wom_enable();
}


void imu_wom_enable(bool enable)
{
	int rc = 0;

	rc += inv_device_set_running_state(device, false);
	check_rc(rc);

	// rc += inv_device_set_sensor_config();
	// check_rc(rc);
}

void imu_twi_cycle()
{
	// Power cycle TWI peripheral to reduce current by +-250uA
    *(volatile uint32_t *)0x40003FFC = 0;
    *(volatile uint32_t *)0x40003FFC;
    *(volatile uint32_t *)0x40003FFC = 1;
}

void imu_sleep_wom()
{
	// Disable interrupts when shutting down
	imu_set_in_shutdown(true);

	// Store IMU offsets in flash memory
	store_offsets();

	// Assuming the device has been initialized before
	// De-init the Invensense implementation
	imu_deinit();

    // Prepare for WoM
    ICM20948_reset();
    ICM_20948_wakeOnMotionITEnable(50, 2.2);

	// Disable IMU timestamp timer
	// Reduces power consumption by +-200uA
    imu_timer_deinit();

	// Power cycle TWI peripheral to reduce current by +-250uA
	imu_twi_cycle();

	// Enable interrupts again
	imu_set_in_shutdown(false);
}

void imu_deinit()
{
	int rc = 0;

	// Reset device to be in a known state
	rc += inv_device_reset(device);
	check_rc(rc);

