jonacappelle/nRF52-BLE-IMU/IMU/imu.c
	// Shutdown IMU and clear internal state
	rc += inv_device_cleanup(device);
	check_rc(rc);
}

void ICM20948_reset()
{
/* Set H_RESET bit to initiate soft reset */
ICM_20948_registerWrite(ICM_20948_REG_PWR_MGMT_1, ICM_20948_BIT_H_RESET);

/* Wait 100ms to complete the reset sequence */
nrf_delay_ms(100);
}

void ICM_20948_bankSelect(uint8_t bank)
{
	uint8_t wBuffer[2];
	wBuffer[0] = ICM_20948_REG_BANK_SEL;
	wBuffer[1] = (bank << 4);

	uint8_t temp[1];
	memcpy(temp, &wBuffer[1], 1);

	ret_code_t error = i2c_write_byte( &m_twi, ICM_20948_I2C_ADDRESS, wBuffer[0], temp, 1, false);
	APP_ERROR_CHECK(error);
}

void ICM_20948_registerWrite(uint16_t addr, uint8_t data)
{
	uint8_t regAddr;
	uint8_t bank;

	regAddr = (uint8_t) (addr & 0x7F);
	bank = (uint8_t) (addr >> 7);

	ICM_20948_bankSelect(bank);
	
	uint8_t temp[1];

	memcpy(temp, &data, 1);

	// int rc = inv_device_write_mems_register(device, 0, addr, temp, 1);
	// check_rc(rc);

	ret_code_t error = i2c_write_byte( &m_twi, ICM_20948_I2C_ADDRESS, regAddr, temp, 1, false);
	APP_ERROR_CHECK(error);

	return;
}
void ICM_20948_registerRead(uint16_t addr, int numBytes, uint8_t *data)
{
	// int rc = inv_device_read_mems_register(device, 0, addr, data, numBytes);
	// check_rc(rc);

	ret_code_t error = i2c_read_bytes( &m_twi, ICM_20948_I2C_ADDRESS, addr, data, 1);
	APP_ERROR_CHECK(error);

	return;
}


uint32_t ICM_20948_sensorEnable(bool accel, bool gyro, bool temp)
{
  uint8_t pwrManagement1;
  uint8_t pwrManagement2;

  ICM_20948_registerRead(ICM_20948_REG_PWR_MGMT_1, 1, &pwrManagement1);
  pwrManagement2 = 0;

  /* To enable the accelerometer clear the DISABLE_ACCEL bits in PWR_MGMT_2 */
  if ( accel ) {
    pwrManagement2 &= ~(ICM_20948_BIT_PWR_ACCEL_STBY);
  } else {
    pwrManagement2 |= ICM_20948_BIT_PWR_ACCEL_STBY;
  }

  /* To enable gyro clear the DISABLE_GYRO bits in PWR_MGMT_2 */
  if ( gyro ) {
    pwrManagement2 &= ~(ICM_20948_BIT_PWR_GYRO_STBY);
  } else {
    pwrManagement2 |= ICM_20948_BIT_PWR_GYRO_STBY;
  }

  /* To enable the temperature sensor clear the TEMP_DIS bit in PWR_MGMT_1 */
  if ( temp ) {
    pwrManagement1 &= ~(ICM_20948_BIT_TEMP_DIS);
  } else {
    pwrManagement1 |= ICM_20948_BIT_TEMP_DIS;
  }

  /* Write back the modified values */
  ICM_20948_registerWrite(ICM_20948_REG_PWR_MGMT_1, pwrManagement1);
  ICM_20948_registerWrite(ICM_20948_REG_PWR_MGMT_2, pwrManagement2);

  return NRF_SUCCESS;
}

uint32_t ICM_20948_sleepModeEnable(bool enable)
{
  uint8_t reg;

  /* Read the Sleep Enable register */
  ICM_20948_registerRead(ICM_20948_REG_PWR_MGMT_1, 1, &reg);

  if ( enable ) {
    /* Sleep: set the SLEEP bit */
    reg |= ICM_20948_BIT_SLEEP;
  } else {
    /* Wake up: clear the SLEEP bit */
    //reg &= ~(ICM_20948_BIT_SLEEP); /* this was the provided code */

	/* My own solution */
	/* AND to define the bits that can be changed: here bit nr 6 */
	reg &= 0b10111111;
	/*OR met 0 to set the SLEEP bit to 0, not really necessary in this case */
	reg |= 0b00000000;
  }

  ICM_20948_registerWrite(ICM_20948_REG_PWR_MGMT_1, reg);


  return NRF_SUCCESS;
}

uint32_t ICM_20948_cycleModeEnable(bool enable)
{
  uint8_t reg;

  reg = 0x00;

  if ( enable ) {
    reg = ICM_20948_BIT_ACCEL_CYCLE | ICM_20948_BIT_GYRO_CYCLE;
  }

  ICM_20948_registerWrite(ICM_20948_REG_LP_CONFIG, reg);

  return NRF_SUCCESS;
}

uint32_t ICM_20948_lowPowerModeEnter(bool enAccel, bool enGyro, bool enTemp)
{
  uint8_t data;

  ICM_20948_registerRead(ICM_20948_REG_PWR_MGMT_1, 1, &data);

  if ( enAccel || enGyro || enTemp ) {
    /* Make sure that the chip is not in sleep */
    ICM_20948_sleepModeEnable(false);

    /* And in continuous mode */
    ICM_20948_cycleModeEnable(false);

    /* Enable the accelerometer and the gyroscope*/
    ICM_20948_sensorEnable(enAccel, enGyro, enTemp);
    nrf_delay_ms(50);

    /* Enable cycle mode */
    ICM_20948_cycleModeEnable(true);

    /* Set the LP_EN bit to enable low power mode */
    data |= ICM_20948_BIT_LP_EN;
  } else {
    /* Enable continuous mode */
    ICM_20948_cycleModeEnable(false);

    /* Clear the LP_EN bit to disable low power mode */
    data &= ~ICM_20948_BIT_LP_EN;
  }

  /* Write the updated value to the PWR_MGNT_1 register */
  ICM_20948_registerWrite(ICM_20948_REG_PWR_MGMT_1, data);

  return NRF_SUCCESS;
}

uint32_t ICM_20948_interruptEnable(bool dataReadyEnable, bool womEnable)
{
  uint8_t intEnable;

  /* All interrupts disabled by default */
  intEnable = 0;

  /* Enable one or both of the interrupt sources if required */
  if ( womEnable ) {
    intEnable = ICM_20948_BIT_WOM_INT_EN;
  }
  /* Write value to register */
  ICM_20948_registerWrite(ICM_20948_REG_INT_ENABLE, intEnable);

//   uint8_t temp[2];
// ICM_20948_registerRead(ICM_20948_REG_INT_ENABLE, 1, &temp[0]);

  /* All interrupts disabled by default */
  intEnable = 0;

  if ( dataReadyEnable ) {
    intEnable = ICM_20948_BIT_RAW_DATA_0_RDY_EN;
  }

  /* Write value to register */
  ICM_20948_registerWrite(ICM_20948_REG_INT_ENABLE_1, intEnable);


// ICM_20948_registerRead(ICM_20948_REG_INT_ENABLE_1, 1, &temp[1]);


  return NRF_SUCCESS;
}

uint32_t ICM_20948_accelBandwidthSet(uint8_t accelBw)
{
  uint8_t reg;

  /* Read the GYRO_CONFIG_1 register */
  ICM_20948_registerRead(ICM_20948_REG_ACCEL_CONFIG, 1, &reg);
  reg &= ~(ICM_20948_MASK_ACCEL_BW);

  /* Write the new bandwidth value to the gyro config register */
  reg |= (accelBw & ICM_20948_MASK_ACCEL_BW);
  ICM_20948_registerWrite(ICM_20948_REG_ACCEL_CONFIG, reg);

  return NRF_SUCCESS;
}

uint32_t ICM_20948_accelFullscaleSet(uint8_t accelFs)
{
  uint8_t reg;

  accelFs &= ICM_20948_MASK_ACCEL_FULLSCALE;
  ICM_20948_registerRead(ICM_20948_REG_ACCEL_CONFIG, 1, &reg);
  reg &= ~(ICM_20948_MASK_ACCEL_FULLSCALE);
  reg |= accelFs;
  ICM_20948_registerWrite(ICM_20948_REG_ACCEL_CONFIG, reg);

  return NRF_SUCCESS;
}

uint32_t ICM_20948_sampleRateSet(float sampleRate)
{
//   ICM_20948_gyroSampleRateSet(sampleRate);
  ICM_20948_accelSampleRateSet(sampleRate);

  return NRF_SUCCESS;
}

float ICM_20948_accelSampleRateSet(float sampleRate)
{
  uint16_t accelDiv;
  float accelSampleRate;

  /* Calculate the sample rate divider */
  accelSampleRate = (1125.0 / sampleRate) - 1.0;

  /* Check if it fits in the divider registers */
  if ( accelSampleRate > 4095.0 ) {
    accelSampleRate = 4095.0;
  }

  if ( accelSampleRate < 0 ) {
    accelSampleRate = 0.0;
  }

  /* Write the value to the registers */
  accelDiv = (uint16_t) accelSampleRate;
  ICM_20948_registerWrite(ICM_20948_REG_ACCEL_SMPLRT_DIV_1, (uint8_t) (accelDiv >> 8) );
  ICM_20948_registerWrite(ICM_20948_REG_ACCEL_SMPLRT_DIV_2, (uint8_t) (accelDiv & 0xFF) );

