jonacappelle/nRF52-BLE-IMU/IMU/imu.c
  /* Calculate the actual sample rate from the divider value */
  accelSampleRate = 1125.0 / (accelDiv + 1);

  return accelSampleRate;
}


void ICM_20948_wakeOnMotionITEnable(uint8_t womThreshold, float sampleRate)
{
	/* Make sure that the chip is not in sleep */
    ICM_20948_sleepModeEnable(false);

	/* And in continuous mode */
    ICM_20948_cycleModeEnable(false);

	/* Enable only the accelerometer */
	ICM_20948_sensorEnable(true, false, false);

	/* Set sample rate */
	ICM_20948_sampleRateSet(sampleRate);

	/* Set the bandwidth to 1210Hz */
	ICM_20948_accelBandwidthSet(ICM_20948_ACCEL_BW_1210HZ);

	/* Accel: 2G full scale */
	ICM_20948_accelFullscaleSet(ICM_20948_ACCEL_FULLSCALE_2G);

	/* Enable the Wake On Motion interrupt */
	ICM_20948_interruptEnable(false, true);
	nrf_delay_ms(50);

	/* Enable Wake On Motion feature */
	ICM_20948_registerWrite(ICM_20948_REG_ACCEL_INTEL_CTRL, ICM_20948_BIT_ACCEL_INTEL_EN | ICM_20948_BIT_ACCEL_INTEL_MODE);

	/* Set the wake on motion threshold value */
	ICM_20948_registerWrite(ICM_20948_REG_ACCEL_WOM_THR, womThreshold);

	/* Enable low power mode */
	ICM_20948_lowPowerModeEnter(true, false, false);

	// Keep track of WoM state
	imu_set_in_wom(true);
}


void apply_stored_offsets(void)
{
	uint8_t sensor_bias[84];
	int32_t acc_bias_q16[6] = {0}, gyro_bias_q16[6] = {0};
	uint8_t i, idx = 0;
	int rc;
	
	/* Retrieve Sel-test offsets stored in NV memory */
	if(usr_flash_check_valid_record() == 0) {
		NRF_LOG_INFO("No bias values retrieved from NV memory !");
		return;
	}

	// Read previous configuration from flash memory
	usr_flash_read(sensor_bias, 84);
	
	for(i = 0; i < 6; i++)
		gyro_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[i * sizeof(uint32_t)]));
	idx += sizeof(gyro_bias_q16);
	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
		VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
	check_rc(rc);
	
	for(i = 0; i < 6; i++)
		acc_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[idx + i * sizeof(uint32_t)]));
	idx += sizeof(acc_bias_q16);
	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
		VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));

	NRF_LOG_INFO("Sensor bias read from flash:");
	NRF_LOG_HEXDUMP_INFO(sensor_bias, 84);	

}

// TODO add sensor gain
void store_offsets(void)
{
	int rc = 0;
	uint8_t i, idx = 0;
	int gyro_bias_q16[6] = {0}, acc_bias_q16[6] = {0};

	static uint8_t sensor_bias[84] = {0};
	
	/* Strore Self-test bias in NV memory */
	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
			VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
	check_rc(rc);
	for(i = 0; i < 6; i++)
		inv_dc_int32_to_little8(gyro_bias_q16[i], &sensor_bias[i * sizeof(uint32_t)]);
	idx += sizeof(gyro_bias_q16);
	
	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
			VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));
	check_rc(rc);
	for(i = 0; i < 6; i++)
		inv_dc_int32_to_little8(acc_bias_q16[i], &sensor_bias[idx + i * sizeof(uint32_t)]);
	idx += sizeof(acc_bias_q16);

	// TODO own implementation needed to store sensor_bias in non volatile memory
	usr_flash_write(sensor_bias, 84);

	NRF_LOG_INFO("Sensor bias written to flash:");
	NRF_LOG_HEXDUMP_INFO(sensor_bias, 84);
}


/**@brief Timeout handler for the repeated timer.
 */
static void calibration_timer_handler(void * p_context)
{
    led_toggle();

	// NRF_LOG_INFO("Cal status: g: %d, a: %d, m: %d", imu_data.gyro_accuracy, imu_data.accel_accuracy, imu_data.mag_accuracy);
}


APP_TIMER_DEF(calibration_timer);     /**< Handler for repeated timer used to blink LED */

void create_calibration_timer()
{
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&calibration_timer,
                                APP_TIMER_MODE_REPEATED,
                                calibration_timer_handler);
    APP_ERROR_CHECK(err_code);
}



bool calibration_timer_running = false;

void start_calibration_timer(uint32_t ms)
{
    ret_code_t err_code;

	// Only start when not running already
	if(!calibration_timer_running)
	{
	    err_code = app_timer_start(calibration_timer, APP_TIMER_TICKS(ms), NULL);
    	APP_ERROR_CHECK(err_code);	

		calibration_timer_running = true;
	}	
}

void stop_calibration_timer()
{
    ret_code_t err_code;

	// Only stop timer when timer is running
	if(calibration_timer_running)
	{
		err_code = app_timer_stop(calibration_timer);
    	APP_ERROR_CHECK(err_code);

		calibration_timer_running = false;
	}

    led_off();
}